NextFOAM-2405/tutorials/heatTransfer/overBuoyantPimpleDyMFoam/movingBox/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;

    div(phi,U)      Gauss upwind;

    energy          Gauss limitedLinear 1;
    div(phi,h)      $energy;
    div(phi,K)      Gauss linear;

    turbulence      Gauss limitedLinear 1;
    div(phi,epsilon) $turbulence;
    div(phi,k)      $turbulence;

    div(((rho*nuEff)*dev2(T(grad(U)))))  Gauss linear;
    div(meshPhi,p)  Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
    laplacian(diffusivity,cellDisplacement)  Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

oversetInterpolation
{
    //method          cellVolumeWeight;
    method            inverseDistance;

    searchBox           (-0.002 0 0)(0.107 0.05 0.01);
    searchBoxDivisions  (300 200 1);
}

fluxRequired
{
    default         no;
    pcorr           ;
    p               ;
}

oversetInterpolationSuppressed
{
    grad(p_rgh);
    surfaceIntegrate(phiHbyA);
}


// ************************************************************************* //
